app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
  #index method relates to index.html.erb file in views/posts folder
    @posts = Post.all

SELECT "categories".* FROM "categories"
---
  def new
    @post = Post.new
    @categories = Category.all.collect {|t| [t.name, t.id] }

SELECT "categories".* FROM "categories"
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "First content post"], ["created_at", Thu, 16 Feb 2012 05:06:25 UTC +00:00], ["title", "Hello world"], ["updated_at", Thu, 16 Feb 2012 05:06:25 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])
    @categories = Category.all.collect {|t| [t.name, t.id] }

    respond_to do |format|
      if @post.save